#include <TextNumbers.hpp>

const std::string TextNumbers::kFrom0To19[20]{"", "один", "два", "три", "четыре",
                                        "пять", "шесть", "семь", "восемь", "девять",
                                       "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать",
                                       "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"};

const std::string TextNumbers::kHundreds[10] {"", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"};

const std::string TextNumbers::kDozens[10] {"", "", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};

const std::string TextNumbers::kOneTwoThousands[3]{"", "одна", "две"};
